---
kind: property
id: P:Autodesk.Revit.DB.ViewSheetSetting.AvailableViews
source: html/7dfeb893-68af-9d54-b92a-789733c01104.htm
---
# Autodesk.Revit.DB.ViewSheetSetting.AvailableViews Property

All views that can be printed.

## Syntax (C#)
```csharp
public ViewSet AvailableViews { get; }
```

## Remarks
Users can select the view/sheet from this view set to printing.